AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Comment>Банк, в случае непрямых расчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Comment>Расчетный, депозитный, ссудный, иной</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Comment>Текст "Плательщик\Получатель" в платежных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Comment>Текст назначения платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>Указывать сумму без копеек, если она в целых рублях</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаУказыватьКПП</Name>
					<Comment>Всегда указывать КПП в платежных документах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосКонтракты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКорпоративныхРасчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБанк</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпискаЗагружаетсяПоДепозитномуСчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЦифровогоСчета</Name>
					<Comment>Идентификатор счета цифрового рубля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ФинУслуги/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции для работы с сервисом 1С:Финуслуги:
// - загрузка данных из сервиса.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОтправитьСтатистикуВСервис", Истина);
	
КонецПроцедуры

#Область ОбращениеКСервису

// Возвращает объект XDTO из корневого элемента XML по схеме пакетаXDTO ФинУслуги.
//
// Параметры:
//	СервисОбменаСБанками - ПеречислениеСсылка.СервисыОбменаСБанками - Сервис.
//	ДанныеXML     - Строка, ХранилищеЗначения - Данные XML из характеристик сервиса заявок на открытие счета.
//
// Возвращаемое значение:
//	ОбъектXDTO, Неопределено - Объект XDTO, прочитанный из XML, или Неопределено в случае ошибок или отсутствия данных.
//
Функция ОбъектXDTOХарактеристики(СервисОбменаСБанками, ДанныеXML) Экспорт
	
	ПредложенияУслуг = ФабрикаXDTO.Тип("http://www.v8.1c.ru/banks/FinancialServices", "ПредложенияУслуг");
	
	Возврат УниверсальныйОбменСБанкамиОбщегоНазначения.ОбъектXDTOХарактеристики(СервисОбменаСБанками, ДанныеXML, ПредложенияУслуг);

КонецФункции

#КонецОбласти

#Область ОбновлениеДанныхСервиса

// Процедура - обработчик начала получения данных о сервисе ФинУслуги.
// Предназначена для вызова из модуля форм, в которых требуются актуальные данные о сервисе.
//
// Параметры:
//  СервисОбменаСБанками - Перечисление.СервисыОбменаСБанками - Сервис обмена.
//  Форма - ФормаКлиентскогоПриложения - должна содержать реквизиты СведенияОСервисе И СведенияОДлительнойОперации
//
Процедура НачатьОбновлениеДанныхСервиса(СервисОбменаСБанками, Форма) Экспорт 
	
	СведенияОСервисе = Форма.СведенияОСервисе;
	СведенияОДлительнойОперации = Форма.СведенияОДлительнойОперации;

	ДатаПоследнегоОбновления = УниверсальныйОбменСБанками.ДатаПоследнегоОбновленияСервиса(
		Перечисления.СервисыОбменаСБанками.ФинУслуги);
	ДлинаСуток = 24 * 60 *60;
	
	Если ЗначениеЗаполнено(ДатаПоследнегоОбновления)
		И НачалоДня(ДатаПоследнегоОбновления) + ДлинаСуток > НачалоДня(ТекущаяДатаСеанса()) Тогда
		СведенияОСервисе.ДанныеАктуальны = Истина;
	КонецЕсли;
	
	Если Форма.ТолькоПросмотр 
		ИЛИ СведенияОСервисе.ДанныеАктуальны
		ИЛИ СведенияОСервисе.ТребуетсяПодключениеИнтернетПоддержки Тогда
		// Обновление не требуется или невозможно.
		Возврат;
	КонецЕсли;
	
	Если СведенияОДлительнойОперации.ДлительнаяОперация <> Неопределено Тогда
		// Не завершено предыдущее фоновое задание, новое не запускаем.
		Возврат;
	КонецЕсли;
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(Форма.УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение           = 0; // Не ждем завершения.
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = 'Обновление данных сервиса %1'"), СервисОбменаСБанками);
	ПараметрыВыполнения.КлючФоновогоЗадания         = "ОбновитьДанныеСервиса";
	
	СведенияОДлительнойОперации.Имя = ПараметрыВыполнения.КлючФоновогоЗадания;
	СведенияОДлительнойОперации.ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, "Обработки.ФинансыОрганизации.ОбновитьДанныеСервиса", СервисОбменаСБанками);

КонецПроцедуры

// Извлекает из архива с файлами файлы креативов по указанным банкам.
//
// Параметры:
//  Банки   - Массив - Массив элементов вида СправочникСсылка.БанкиУниверсальногоОбмена. 
//  ИдентификаторФормы   - Уникальный идентификатор.
//
Функция ДанныеКреативов(Банки, МассивИменФайлов, ИдентификаторФормы) Экспорт
	
	КреативыБанков = НовыйКреативыБанков();

	Сервис = Перечисления.СервисыОбменаСБанками.ФинУслуги;
	Результат = Новый Соответствие;
	
	ТаблицаХарактеристик = УниверсальныйОбменСБанками.ХарактеристикиУслугБанков(Сервис, 
		Перечисления.ХарактеристикиСервисаФинУслуги.ФайлыКреативов, Банки);

	Для Каждого Банк Из Банки Цикл
		
		Характеристики = ТаблицаХарактеристик.Найти(Банк, "Банк");
		Если Характеристики = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстBase64 = Характеристики.Значение.Получить();
		Если Не ЗначениеЗаполнено(ТекстBase64) Тогда
			Продолжить;
		КонецЕсли;
	
		ДанныеАрхива = Base64Значение(ТекстBase64);
		Архив = Новый ЧтениеZipФайла(ДанныеАрхива.ОткрытьПотокДляЧтения());
			
		ПапкаШаблона = ФайловаяСистема.СоздатьВременныйКаталог();
		Архив.ИзвлечьВсе(ПапкаШаблона);
		Архив.Закрыть();
		ДанныеАрхива = Неопределено;
		НайденныеФайлы = НайтиФайлы(ПапкаШаблона, ПолучитьМаскуВсеФайлы(), Истина);
		
		Для Каждого ДанныеКреатива Из НайденныеФайлы Цикл
			
			Если МассивИменФайлов.Найти(ДанныеКреатива.Имя) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СтрокаТаблицы = КреативыБанков.Добавить();
			СтрокаТаблицы.Банк = Банк;
			СтрокаТаблицы.ИмяКреатива = ДанныеКреатива.Имя;  
			ДвоичныеДанныеКреатива = Новый ДвоичныеДанные(ДанныеКреатива.ПолноеИмя);
			СтрокаТаблицы.АдресКреатива = ПоместитьВоВременноеХранилище(ДвоичныеДанныеКреатива, ИдентификаторФормы);
			
		КонецЦикла;

		ФайловаяСистема.УдалитьВременныйКаталог(ПапкаШаблона);
		
	КонецЦикла;
	
	Возврат КреативыБанков;
	
КонецФункции

Процедура СкрытьБаннерПоИдентификатору(Идентификатор, ТекущаяПозицияБаннеры) Экспорт
	
	ЗакрытыеПользователемБаннеры = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		Обработки.ФинансыОрганизации.ИмяНастройкиСервиса(),
		Обработки.ФинансыОрганизации.ИмяКлючНастройкиЗакрытыеПользователемБаннеры(),
		Новый Соответствие);
		
	ЗакрытыеПользователемБаннеры.Вставить(Идентификатор, ТекущаяДатаСеанса());
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		Обработки.ФинансыОрганизации.ИмяНастройкиСервиса(),
		Обработки.ФинансыОрганизации.ИмяКлючНастройкиЗакрытыеПользователемБаннеры(),
		ЗакрытыеПользователемБаннеры);
		
	ТекущаяПозицияБаннеры = Макс (1, ТекущаяПозицияБаннеры -1);
		
КонецПроцедуры

#КонецОбласти

#Область ОтправкаСтатистикиВСервис

// Процедура - обработчик начала получения данных о сервисе ФинУслуги.
// Предназначена для вызова из модуля форм, в которых требуются актуальные данные о сервисе.
//
// Параметры:
//  СервисОбменаСБанками - Перечисление.СервисыОбменаСБанками - Сервис обмена.
//  Форма - ФормаКлиентскогоПриложения - должна содержать реквизиты СведенияОСервисе И СведенияОДлительнойОперации
//
Процедура НачатьОтправкуСтатистикиВСервис(СервисОбменаСБанками, Форма, СодержимоеСтатистики) Экспорт 

	СведенияОДлительнойОперации = Форма.СведенияОДлительнойОперацииСтатистика;
	ТокенАвторизации = Форма.ТокенАвторизации;
	АдресХранилища = Форма.АдресХранилищаОтправкаСтатистики;

	Если СведенияОДлительнойОперации.ДлительнаяОперация <> Неопределено Тогда
		// Не завершено предыдущее фоновое задание, новое не запускаем.
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение           = 0; // Не ждем завершения.
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = 'Отправка статистики в сервис %1'"), СервисОбменаСБанками);
	ПараметрыВыполнения.КлючФоновогоЗадания = ПараметрыВыполнения.КлючФоновогоЗадания;
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("СервисОбменаСБанками", СервисОбменаСБанками);
	ПараметрыПроцедуры.Вставить("СодержимоеСтатистики", СодержимоеСтатистики);
	ПараметрыПроцедуры.Вставить("ТокенАвторизации", ТокенАвторизации);
	
	СведенияОДлительнойОперации.Имя = "ОтправитьСтатистикуВСервис";
	СведенияОДлительнойОперации.ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
		"ФинУслуги.ОтправитьСтатистикуВСервис", ПараметрыПроцедуры, АдресХранилища);
		
КонецПроцедуры

Процедура ОтправитьСтатистикуВСервис(Параметры, АдресХранилища) Экспорт
	
	СтрокаСтатистики = УниверсальныйОбменСБанками.СтруктуруВСтрокуJSON(Параметры.СодержимоеСтатистики);
	СтрокаСтатистики = СтрЗаменить(СтрокаСтатистики, Символы.ВК + Символы.ПС, ""); 
	СтрокаСтатистики = СтрЗаменить(СтрокаСтатистики, Символы.ПС, "");  
	СтрокаСтатистики = СтрЗаменить(СтрокаСтатистики, ",", "|");
	Результат = УниверсальныйОбменСБанками.СохранитьЗаписьАктивностиСервиса(Параметры.СервисОбменаСБанками,
		Параметры.ТокенАвторизации, "stat_finserv", СтрокаСтатистики);
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается после загрузки данных услуги банка, полученных с сервера.
// Параметры:
//		УслугаБанка - СправочникСсылка.УслугиБанков - ссылка на элемент справочника, данные которого были обновлены.
Процедура ПослеЗагрузкиДанныхУслугиБанка(УслугаБанка) Экспорт
	
	Если Не ЗначениеЗаполнено(УслугаБанка) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Характеристика Из УслугаБанка.Характеристики Цикл
		ОбработатьХарактеристику(Характеристика, УслугаБанка);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает XDTO объект из пакета ФинУслуги с информацией о финансовом предложении банка.
//
// Параметры:
//	СервисОбменаСБанками - ПеречислениеСсылка.СервисыОбменаСБанками - Сервис.
//	УсловияОбслуживанияXDTO - ОбъектXDTO - Корневой объект из пакета XDTO ФинУслуги, в котором производится поиск.
//	ИдентфикаторПродукта - Строка - Идентификатор искомого финансового продукта.
//	Дата - Дата - Дата, по состоянию на которую возвращает информация.
//
// Возвращаемое значение:
//	ОбъектXDTO или Неопределено
//
Функция НайтиФинансовыйПродукт(СервисОбменаСБанками, УсловияОбслуживанияXDTO, Знач ИдентфикаторПродукта, Знач Дата) Экспорт

	Если УсловияОбслуживанияXDTO = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТекущаяВерсияСервиса = УниверсальныйОбменСБанками.ВерсияСервиса(СервисОбменаСБанками);
	Дата                 = НачалоДня(Дата);
	ИдентфикаторПродукта = ВРег(ИдентфикаторПродукта);

	ФинансовыйПродуктПоУмолчанию = Неопределено;
	
	Для каждого ФинансовыйПродукт Из УсловияОбслуживанияXDTO.ФинансовыйПродукт Цикл

		Если ФинансовыйПродукт.ДатаНачала > Дата
			ИЛИ ФинансовыйПродукт.ДатаОкончания < Дата Тогда
			Продолжить;
		КонецЕсли;
		
		// Проверим версии сервиса, для которых применяются условия.
		Если ЗначениеЗаполнено(ФинансовыйПродукт.МинВерсияСервиса)
			И УниверсальныйОбменСБанкамиКлиентСервер.СравнитьВерсии(ТекущаяВерсияСервиса, ФинансовыйПродукт.МинВерсияСервиса) < 0 Тогда
			// Продукт может быть корректно отображен только в следующих версиях программы, 
			// для текущей версии его пропускаем.
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ФинансовыйПродукт.МаксВерсияСервиса)
			И УниверсальныйОбменСБанкамиКлиентСервер.СравнитьВерсии(ТекущаяВерсияСервиса, ФинансовыйПродукт.МаксВерсияСервиса) > 0 Тогда
			// Продукт предназначен для отображения на предыдущих версиях программы,
			// для текущей версии его пропускаем.
			Продолжить;
		КонецЕсли;
	
		Если ФинансовыйПродукт.Свойства().Получить("Идентификатор") = Неопределено
			ИЛИ НЕ ЗначениеЗаполнено(ФинансовыйПродукт.Идентификатор) Тогда
			// В старых настройках могут быть продукты, у которых еще не было идентификатора.
			// Если не найдем никакого продукта с искомым идентификатором, то вернем без идентификатора.
			ФинансовыйПродуктПоУмолчанию = ФинансовыйПродукт;
			Продолжить;
		КонецЕсли;
		
		Если ВРег(ФинансовыйПродукт.Идентификатор) = ИдентфикаторПродукта Тогда
			Возврат ФинансовыйПродукт;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ФинансовыйПродуктПоУмолчанию;

КонецФункции

Процедура НачатьПолучениеПредложенийБанков(Форма) Экспорт
	
	Если ФинУслугиКлиентСервер.ЭтоФормаСИнформационнойПанелью(Форма.ИмяФормы) И Форма.КоличествоБаннеров = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивАдресов = АдресаКреативовБанковДляОчистки(Форма.КреативыБанков);
    ОчиститьАдресВоВременномХранилище(МассивАдресов);
	
	ПараметрыПроцедуры = ПараметрыПолученияПредложенийПоВидуФормы(Форма);
	СведенияОДлительнойОперации = Форма.СведенияОДлительнойОперации;
	Если СведенияОДлительнойОперации.ДлительнаяОперация <> Неопределено Тогда
		// Не завершено предыдущее фоновое задание, новое не запускаем.
		Возврат;
	КонецЕсли;
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(Форма.УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение           = 0; // Не ждем завершения.
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение предложений банков'");
	ПараметрыВыполнения.КлючФоновогоЗадания         = "ПолучитьПредложения";
	
	СведенияОДлительнойОперации.Имя = ПараметрыВыполнения.КлючФоновогоЗадания;
	СведенияОДлительнойОперации.ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, "Обработки.ФинансыОрганизации.СведенияОПредложенияхБанков", ПараметрыПроцедуры);

КонецПроцедуры

Процедура НачатьЗаполнениеКалендаряНаСервере(ДлительнаяОперацияПлатежныйКалендарь, 
		Организация, УникальныйИдентификатор, ГоризонтПланирования) Экспорт
			
	ПараметрыПроцедуры = ПодготовитьПараметрыЗаполненияКалендаря(Организация, ГоризонтПланирования);
		
	Если ДлительнаяОперацияПлатежныйКалендарь.ДлительнаяОперация <> Неопределено Тогда
		// Не завершено предыдущее фоновое задание, новое не запускаем.
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение данных платежного календаря.'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	ДлительнаяОперацияПлатежныйКалендарь.Имя = "ЗаполнитьКалендарь";
	ДлительнаяОперацияПлатежныйКалендарь.ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ПлатежныйКалендарь.ЗаполнитьКалендарь", ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецПроцедуры

Функция НовыйДанныеПлатежейСегодня() Экспорт
	
	// Структура используется в форме Финансы организации
	// и в формах с инфопанелью
	
	Результат = Новый Структура;
	Результат.Вставить("Организация", Справочники.Организации.ПустаяСсылка()); 
	Результат.Вставить("Банк", Справочники.Банки.ПустаяСсылка()); 
	Результат.Вставить("БанковскийСчет", Справочники.БанковскиеСчета.ПустаяСсылка());
	Результат.Вставить("ДатаАктуальности", Дата(1, 1, 1));
	Результат.Вставить("МассивПлатежныхПоручений", Новый Массив);
    Результат.Вставить("ПланируемыеПлатежиСегодняПриход", 0);   
	Результат.Вставить("ПланируемыеПлатежиСегодняРасход", 0);
	Результат.Вставить("ПлатежиСегодняПриход", 0);   
	Результат.Вставить("ПлатежиСегодняРасход", 0);
   	Результат.Вставить("ВнеплановыеПлатежиСегодняРасход", 0); 
	Результат.Вставить("АдресПлатежныеПоручения", "");
	Результат.Вставить("АдресПланируемыеПлатежиПоДням", "");
	Результат.Вставить("АдресВнеплановыеПлатежиСегодня", "");
	Результат.Вставить("АдресПлатежиСегодняПоБанкам", "");  
    Результат.Вставить("Инфопанель", Ложь);

    Возврат Результат;
	
КонецФункции

#Область ОбработчикиОбновления

// Процедура устанавливает значение реквизита "Версия" справочника "Услуги банков" равным 0.
// Может быть использована для принудительного обновления данных в этом справочнике при
// следующей синхронизации с сервером обмена.
Процедура СброситьВерсиюУслугБанкаФинУслуги() Экспорт
	
	УниверсальныйОбменСБанками.СброситьВерсиюУслугБанка(Перечисления.СервисыОбменаСБанками.ФинУслуги);
	
КонецПроцедуры

#КонецОбласти

#Область СведенияДляПредложенийБанков

Функция СведенияОбОрганизациях(ДатаАктуальности, Организация) Экспорт
	
	ДатаФактическогоНачала = УниверсальныйОбменСБанкамиФормы.ДатаФактическогоНачалаВеденияБизнеса(Организация, ДатаАктуальности);

	Результат = Новый Массив;
	
	МассивОрганизаций = Обработки.ФинансыОрганизации.МассивОрганизаций(Организация);
	РеквизитыОрганизаций = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОрганизаций, 
			"ЮридическоеФизическоеЛицо, ИндивидуальныйПредприниматель, ИностраннаяОрганизация, ДатаРегистрации, КодОКВЭД2, КодОКОПФ, ИНН");
	
	КонтактнаяИнформацияОбъектов = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияОбъектовНаДату(
			МассивОрганизаций, Неопределено,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации),
			ДатаАктуальности);

	Для Каждого ЭлементМассива Из МассивОрганизаций Цикл
		
		РеквизитыОрганизации = РеквизитыОрганизаций.Получить(ЭлементМассива);
		Если РеквизитыОрганизации = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		// Заполним сведения о клиенте для подбора банков по текущим условиям.
		Сведения = Обработки.ФинансыОрганизации.НовыеСведенияОбОрганизации();
		Сведения.Организация               = ЭлементМассива;    
		Сведения.ИНН               = РеквизитыОрганизации.ИНН;
		Сведения.ЮридическоеФизическоеЛицо = РеквизитыОрганизации.ЮридическоеФизическоеЛицо;
		Сведения.ДатаАктуальности = ДатаАктуальности;

		Если РеквизитыОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			ФизическоеЛицо = РеквизитыОрганизации.ИндивидуальныйПредприниматель;
			Гражданство = ГражданствоФизическогоЛица(ФизическоеЛицо);
			Сведения.Нерезидент = Гражданство <> Справочники.СтраныМира.Россия;
			Сведения.ДатаРождения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизическоеЛицо, "ДатаРождения");
			Сведения.ВозрастИП = ОбщегоНазначенияБПКлиентСервер.КоличествоЦелыхЛет(Сведения.ДатаРождения, ДатаАктуальности);
		Иначе
			Сведения.Нерезидент  = РеквизитыОрганизации.ИностраннаяОрганизация;
		КонецЕсли;

		Сведения.ДатаРегистрации   = РеквизитыОрганизации.ДатаРегистрации;
		Сведения.СрокОтДатыРегистрации = ОбщегоНазначенияБПКлиентСервер.КоличествоЦелыхМесяцев(
			Сведения.ДатаРегистрации, ДатаАктуальности);
		Сведения.КодОКВЭД2         = СокрЛП(РеквизитыОрганизации.КодОКВЭД2);
		Сведения.КодОКОПФ          = СокрЛП(РеквизитыОрганизации.КодОКОПФ);
		
		КонтактнаяИнформацияОбъекта = КонтактнаяИнформацияОбъектов.Найти(ЭлементМассива, "Объект");
		Если ЗначениеЗаполнено(КонтактнаяИнформацияОбъекта) Тогда
			Сведения.ЮрАдресОрганизации = КонтактнаяИнформацияОбъекта.Значение;
		КонецЕсли;
		
		Сведения.ДатаФактическогоНачалаВеденияБизнеса = ДатаФактическогоНачала;
		Сведения.СрокФактическогоВеденияБизнеса = 
			ОбщегоНазначенияБПКлиентСервер.КоличествоЦелыхМесяцев(ДатаФактическогоНачала, ДатаАктуальности);

		КодРегиона = "";
		Если ЗначениеЗаполнено(Сведения.ЮрАдресОрганизации) Тогда
			СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(Сведения.ЮрАдресОрганизации);
			КодРегиона = СведенияОбАдресе.КодРегиона;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(КодРегиона) Тогда
			// Если из адреса определить код региона не получилось, то ищем через регистрацию в налоговом органе.
			ОсновнаяРегистрацияВНалоговомОргане = Справочники.Организации.РегистрацияВНалоговомОрганеНаДату(
				ЭлементМассива, ДатаАктуальности);
			Если ЗначениеЗаполнено(ОсновнаяРегистрацияВНалоговомОргане) Тогда
				РеквизитыРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОсновнаяРегистрацияВНалоговомОргане, "КодРегиона");
				Если ЗначениеЗаполнено(РеквизитыРегистрации.КодРегиона) Тогда
					// В настройках сервиса код региона задан в виде строки с лидирующем нулем.
					КодРегиона = Формат(РеквизитыРегистрации.КодРегиона, "ЧЦ=2;ЧВН=");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Сведения.КодРегиона = СокрЛП(КодРегиона);
		Сведения.ДополнительныеСвойства.Вставить("ХешСуммаИНН", ХешСуммаСтроки(Сведения.ИНН));
		
		Результат.Добавить(Сведения);
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Процедура ОтправитьСтатистику(Форма, УникальныйИдентификатор) Экспорт
	
	Если ОбщегоНазначения.РежимОтладки() 
		Или БлокировкаРаботыСВнешнимиРесурсами.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		Форма.ТаблицаСтатистики.Очистить();
	КонецЕсли;
	
	МассивСтатистики = МассивСтатистики(Форма.ТаблицаСтатистики);
	Если МассивСтатистики.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СтруктураДанныхСтатистики = Новый Структура;
	СтруктураДанныхСтатистики.Вставить("ПоказыИПереходы", МассивСтатистики);
	
	СервисОбменаСБанками = Перечисления.СервисыОбменаСБанками.ФинУслуги; 
	// В хранилище храним результат отправки статистики. 
	// Если результат отправки неуспешный, статистика накапливается,
	// в противном случае - очищается
	Форма.АдресХранилищаОтправкаСтатистики = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);

	НачатьОтправкуСтатистикиВСервис(СервисОбменаСБанками, Форма, СтруктураДанныхСтатистики);
		
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьИсполненныеПлатежиСегодня(ДанныеПлатежей) Экспорт
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.БанковскиеСчета).Банк КАК Банк,
	|	ХозрасчетныйОбороты.СуммаОборотДт КАК Приход,
	|	ХозрасчетныйОбороты.СуммаОборотКт КАК Расход,
	|	ХозрасчетныйОбороты.Организация КАК Организация
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоДня,
	|			&КонецДня,
	|			Авто,
	|			Счет В (&СчетаУчета),
	|			,
	|			&ОтборПоОрганизации
	|				И &ОтборПоБанковскомуСчету,
	|			,
	|			) КАК ХозрасчетныйОбороты");
	
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ДанныеПлатежей.ДатаАктуальности));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ДанныеПлатежей.ДатаАктуальности));
		 
	ИзменитьТекстЗапросаПоОрганизации(Запрос, ДанныеПлатежей.Организация);
	ИзменитьТекстЗапросаПоБанковскомуСчету(Запрос, ДанныеПлатежей.БанковскийСчет);
	
	МассивСчетов = УчетДенежныхСредствПовтИсп.ПолучитьСчетаССубконтоБанковскиеСчета();
	
	Запрос.УстановитьПараметр("СчетаУчета", МассивСчетов);
		
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	ДанныеПлатежей.ПлатежиСегодняПриход = 0;
	ДанныеПлатежей.ПлатежиСегодняРасход = 0;

	ТаблицаОбороты = Результат.Выгрузить();
	ПоместитьВоВременноеХранилище(ТаблицаОбороты, ДанныеПлатежей.АдресПлатежиСегодняПоБанкам);
	ДанныеПлатежей.ПлатежиСегодняПриход = ТаблицаОбороты.Итог("Приход");
	ДанныеПлатежей.ПлатежиСегодняРасход = ТаблицаОбороты.Итог("Расход");
		
КонецПроцедуры

Процедура ИзменитьТекстЗапросаПоОрганизации(Запрос, Организация) Экспорт
	
	МассивДоступныхОрганизаций = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);

	Если ЗначениеЗаполнено(Организация) И МассивДоступныхОрганизаций.Найти(Организация) <> Неопределено Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоОрганизации", "Организация = &Организация"); 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборБанковскогоСчетаПоОрганизации", "БанковскиеСчета.Владелец = &Организация");
		Запрос.УстановитьПараметр("Организация", Организация);
		
	ИначеЕсли Не ЗначениеЗаполнено(Организация) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоОрганизации", "Организация В (&Организации)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборБанковскогоСчетаПоОрганизации", "БанковскиеСчета.Владелец В (&Организации)");
        Запрос.УстановитьПараметр("Организации", МассивДоступныхОрганизаций); 
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоОрганизации", "Ложь");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборБанковскогоСчетаПоОрганизации", "Ложь");

	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьТекстЗапросаПоБанковскомуСчету(Запрос, БанковскийСчет) Экспорт
	
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоБанковскомуСчету", "Субконто1 = &БанковскийСчет"); 
		Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоБанковскомуСчету", "Истина");
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицыПлатежей(ДанныеПлатежейСегодня, АдресХранилища) Экспорт
	
		
	ПлатежиПоДатам = ПлатежиПоДатам(АдресХранилища);
	
	Если ПлатежиПоДатам = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДатаПлатежаСегодня = НачалоДня(ДанныеПлатежейСегодня.ДатаАктуальности);
    ПлатежиКалендаряСегодня = ПлатежиКалендаряСегодня(ПлатежиПоДатам, ДатаПлатежаСегодня);

	Запрос = Новый Запрос;
	Запрос.Текст = ЗапросТаблицыВнеплановыхПлатежей();
	
	Запрос.УстановитьПараметр("ДатаПлатежаНачало", ДатаПлатежаСегодня - 86400 * 9);
	Запрос.УстановитьПараметр("ДатаПлатежаКонец", КонецДня(ДанныеПлатежейСегодня.ДатаАктуальности));
	Запрос.УстановитьПараметр("ПлатежиКалендаряСегодня", ПлатежиКалендаряСегодня);
	Запрос.УстановитьПараметр("Состояние", ФинУслугиКлиентСервер.СостоянияПлатежныхПоручений());
			
	Если ЗначениеЗаполнено(ДанныеПлатежейСегодня.Организация) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоОрганизации", "ПлатежноеПоручение.Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", ДанныеПлатежейСегодня.Организация);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоОрганизации", "Истина");
	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ВнеплановыеПлатежи = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
		
	ТаблицаПлатежныхПоручений = ВнеплановыеПлатежи.Скопировать();
	ВнеплановыеПлатежи.Свернуть("БанковскийСчет, Банк", "Сумма");

    ПоместитьВоВременноеХранилище(ВнеплановыеПлатежи, ДанныеПлатежейСегодня.АдресВнеплановыеПлатежиСегодня);
    ПоместитьВоВременноеХранилище(ТаблицаПлатежныхПоручений, ДанныеПлатежейСегодня.АдресПлатежныеПоручения);
	
	ДанныеПлатежейСегодня.ПланируемыеПлатежиСегодняПриход = ПлатежиКалендаряСегодня.Итог("Приход");
	ДанныеПлатежейСегодня.ПланируемыеПлатежиСегодняРасход =  ПлатежиКалендаряСегодня.Итог("Расход"); 
			
	// Для формы Финансы организации заполняется таблица платежей по дням, 
	Если ЗначениеЗаполнено(ДанныеПлатежейСегодня.АдресПланируемыеПлатежиПоДням) Тогда
		ПлатежиПоДатам.Свернуть("ДатаПлатежа", "Приход, Расход");
		ПлатежиПоДатам.Сортировать("ДатаПлатежа");
		ПланируемыеПлатежи = ПланируемыеПлатежиПятьДней(ПлатежиПоДатам, ДатаПлатежаСегодня);
		ДополнитьТаблицуДатами(ПланируемыеПлатежи, ДанныеПлатежейСегодня.ДатаАктуальности); 
		ПоместитьВоВременноеХранилище(ПланируемыеПлатежи, ДанныеПлатежейСегодня.АдресПланируемыеПлатежиПоДням);
	КонецЕсли;
	
КонецПроцедуры

Функция ИспользоватьПланированиеПлатежей() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ОтПокупателей", ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеПлатежейОтПокупателей"));
	Результат.Вставить("Поставщикам", ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеПлатежейПоставщикам"));

	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДанныеПлатежиСегодня(Форма, РеквизитыБанковскогоСчета, ПолучитьДанныеПлатежногоКалендаря) Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ДатаАктуальности = 
		?(ЗначениеЗаполнено(Форма.ОтборДатаОтбора) И Форма.ОтборДатаОтбораИспользование, Форма.ОтборДатаОтбора, ТекущаяДата);
	Организация = 
			?(ЗначениеЗаполнено(Форма.ОтборОрганизация) И Форма.ОтборОрганизацияИспользование, Форма.ОтборОрганизация, Неопределено);
			
	ГоризонтПланирования = ФинУслугиКлиентСервер.ДнейПланированияКалендаряДляИнфопанели(ДатаАктуальности, ТекущаяДата);
	
	Если ПолучитьДанныеПлатежногоКалендаря Тогда
			
		Форма.ДлительнаяОперацияПлатежныйКалендарь = Новый Структура();
		Форма.ДлительнаяОперацияПлатежныйКалендарь.Вставить("Имя", "");
		Форма.ДлительнаяОперацияПлатежныйКалендарь.Вставить("ДлительнаяОперация");

		НачатьЗаполнениеКалендаряНаСервере(Форма.ДлительнаяОперацияПлатежныйКалендарь, 
				Форма.ОтборОрганизация, Форма.УникальныйИдентификатор, ГоризонтПланирования);
	КонецЕсли;
			
	Если Форма.ДанныеПлатежейСегодня = Неопределено Тогда
		
		Форма.ДанныеПлатежейСегодня = НовыйДанныеПлатежейСегодня();
		Форма.ДанныеПлатежейСегодня.АдресПлатежныеПоручения = 
			ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
		Форма.ДанныеПлатежейСегодня.АдресВнеплановыеПлатежиСегодня = 
			ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
        Форма.ДанныеПлатежейСегодня.АдресПлатежиСегодняПоБанкам = 
			ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
			
	КонецЕсли;
	
	Форма.ДанныеПлатежейСегодня.Организация = Организация;
	Форма.ДанныеПлатежейСегодня.Банк = РеквизитыБанковскогоСчета.Банк; 
	Форма.ДанныеПлатежейСегодня.БанковскийСчет = РеквизитыБанковскогоСчета.БанковскийСчет;
	Форма.ДанныеПлатежейСегодня.ДатаАктуальности = ДатаАктуальности;
    Форма.ДанныеПлатежейСегодня.ИнфоПанель = Истина;
	
	Форма.Элементы.ДатаПлатежиСегодня.Заголовок = Формат(ДатаАктуальности, "ДФ='дддд, дд ММММ ЧЧ:мм'");
	
	ЗаполнитьИсполненныеПлатежиСегодня(Форма.ДанныеПлатежейСегодня);
		
КонецПроцедуры

Функция ИмяНастройкиИнфоПанель()
	
	Возврат "ИнфоПанель";
	
КонецФункции

Функция ИмяКлючНастройкиЗакрытиеИнфоПанель()
	
	Возврат "ИнфоПанельЗакрытие";
	
КонецФункции

Функция ПоказыватьИнфоПанель(ИмяПользователя) Экспорт
	
	Результат = Истина;
	ПараметрыЗакрытия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		ИмяНастройкиИнфоПанель(),
		ИмяКлючНастройкиЗакрытиеИнфоПанель(), , , ИмяПользователя);
		
	Если Не ПараметрыЗакрытия = Неопределено Тогда
			
		ДатаЗакрытия = ПараметрыЗакрытия.ДатаЗакрытия;
		ПериодЗакрытия = 86400 * 30;
		
		Если ТекущаяДатаСеанса() - ДатаЗакрытия >= ПериодЗакрытия Тогда
			ОбщегоНазначения.ХранилищеОбщихНастроекУдалить(ИмяНастройкиИнфоПанель(), 
				ИмяКлючНастройкиЗакрытиеИнфоПанель(), ИмяПользователя);
		Иначе
			Результат = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сохраняет решение пользователя закрыть инфопанель в хранилище
// общих настроек.
// 
// Параметры:
//  ИмяПользователя - Строка - см. ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить.
//
Процедура СохранитьЗакрытиеИнфоПанели(ИмяПользователя) Экспорт
	
	ПоказыватьИнфоПанель = ПоказыватьИнфоПанель(ИмяПользователя);
	
	Если ПоказыватьИнфоПанель Тогда
		
		ПараметрыЗакрытия = ПараметрыЗакрытияИнфоПанель();
		ПараметрыЗакрытия.ДатаЗакрытия = ТекущаяДатаСеанса();
		
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			ИмяНастройкиИнфоПанель(),
			ИмяКлючНастройкиЗакрытиеИнфоПанель(),
			ПараметрыЗакрытия, , ИмяПользователя);
		
	КонецЕсли;
		
КонецПроцедуры

// Проверяет наличие данных о решении пользователя закрыть инфопанель и удаляет их.
// 
// Параметры:
//  ИмяПользователя - Строка - см. ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить.
//
Процедура ПроверитьИУдалитьДанныеОЗакрытииИнфоПанели(ИмяПользователя) Экспорт
	
	Если ПоказыватьИнфоПанель(ИмяПользователя) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.ХранилищеОбщихНастроекУдалить(ИмяНастройкиИнфоПанель(), 
		ИмяКлючНастройкиЗакрытиеИнфоПанель(), ИмяПользователя);
	
КонецПроцедуры

Процедура ПриСозданииНаСервереИнфоПанель(Форма) Экспорт
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
    	Форма.Элементы.ГруппаПанельИнформации.Видимость = Ложь; 
		Форма.Элементы.ПоказатьПанельИнформации.Видимость = Ложь; 
		Возврат;
	КонецЕсли;
				
	ДополнительныеПараметрыДепозитов = 
		ОбменСБанкамиДепозитыСлужебныйКлиентСервер.ДополнительныеПараметрыДепозитов(Форма); 
	ДоступенФункционалДепозиты = ДополнительныеПараметрыДепозитов <> Неопределено;
	
	Если ДоступенФункционалДепозиты Тогда
		ТекущаяОрганизация = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, 
			ДополнительныеПараметрыДепозитов.ПутьКРеквизитуОрганизация);
	КонецЕсли;
		
	НастройкаПоказыватьИнфоПанель = НастройкаПоказыватьИнфоПанель();
	Форма.Элементы.ГруппаПанельИнформации.Видимость = НастройкаПоказыватьИнфоПанель;
	
	Если НастройкаПоказыватьИнфоПанель Тогда
		ОбновитьСведенияОСервисеФинУслуги(Форма);
	КонецЕсли;
	
	ПоказыватьДепозиты = ОбменСБанкамиДепозитыВызовСервера.ПоказыватьПанельРасчетаДепозитов()	
		И ДоступенФункционалДепозиты 
		И ЗначениеЗаполнено(ТекущаяОрганизация);
		
	Если ПоказыватьДепозиты Тогда
		Форма.ВариантПанели = "ДепозитныйКалькулятор";	
	Иначе
		Форма.ВариантПанели = "Платежи"; 
	КонецЕсли;
	
	Форма.Элементы.ГруппаПлатежиИРасчеты.Видимость = Не ПоказыватьДепозиты;
	Форма.Элементы.ВариантПанели.Видимость = ДоступенФункционалДепозиты; 
    Форма.Элементы.ЗаголовокПлатежи.Видимость = Не ДоступенФункционалДепозиты; 

КонецПроцедуры

Процедура ОбновитьСведенияОСервисеФинУслуги(Форма) Экспорт
	
	СервисОбменаСБанками = Перечисления.СервисыОбменаСБанками.ФинУслуги;
	Форма.СведенияОДлительнойОперации = Новый Структура();
	Форма.СведенияОДлительнойОперации.Вставить("Имя", "");
	Форма.СведенияОДлительнойОперации.Вставить("ДлительнаяОперация");
	Форма.СведенияОДлительнойОперацииСтатистика = Новый Структура();
	Форма.СведенияОДлительнойОперацииСтатистика.Вставить("Имя", "");
	Форма.СведенияОДлительнойОперацииСтатистика.Вставить("ДлительнаяОперация");
	Форма.СведенияОСервисе = УниверсальныйОбменСБанками.СведенияОСервисе(СервисОбменаСБанками);
	ЭтоВебКлиент = ОбщегоНазначения.ЭтоВебКлиент();
	Форма.КоличествоБаннеров = ФинУслугиКлиентСервер.МаксимальноеКоличествоБаннеров(Форма.ИмяФормы, ВысотаЭкрана(), ЭтоВебКлиент);
	
	Если Форма.КоличествоБаннеров > 0 Тогда
		НачатьОбновлениеДанныхСервиса(СервисОбменаСБанками, Форма);
	КонецЕсли;
	
КонецПроцедуры

Функция ИНН1ССофт() Экспорт
	Возврат "7730643014";
КонецФункции

Процедура ВывестиПлатежиСегодня(Форма) Экспорт
	
	ОпцияПлатежи = Ложь;
	ЗаполнитьДанныеВнеплановыхПлатежей(Форма.ДанныеПлатежейСегодня, ОпцияПлатежи);  

	ФинУслугиКлиентСервер.УстановитьВидимостьДанныхПлатежи(Форма, Истина, ОпцияПлатежи);
	
	ФорматСумм = "ЧДЦ=2; ЧН=0,00";
	ДанныеПлатежейСегодня = Форма.ДанныеПлатежейСегодня;
	Элементы = Форма.Элементы;
	
	СуммаПолучено = ДанныеПлатежейСегодня.ПлатежиСегодняПриход;
	СуммаОсталосьПолучить = ДанныеПлатежейСегодня.ПланируемыеПлатежиСегодняПриход;
	СуммаКПоступлению = СуммаПолучено + СуммаОсталосьПолучить;
	СуммаИсполнено = ДанныеПлатежейСегодня.ПлатежиСегодняРасход;
	СуммаКОплате = СуммаИсполнено + ДанныеПлатежейСегодня.ПланируемыеПлатежиСегодняРасход 
		+ ДанныеПлатежейСегодня.ВнеплановыеПлатежиСегодняРасход;
			
	Элементы.СуммаПолучено.Заголовок = Формат(СуммаПолучено, ФорматСумм);
	Гиперссылка = СуммаПолучено <> 0;
	Элементы.СуммаПолучено.Гиперссылка = Гиперссылка;
	
	Элементы.СуммаОсталосьПолучить.Заголовок = Формат(СуммаОсталосьПолучить, ФорматСумм);
	Гиперссылка = СуммаОсталосьПолучить <> 0;
	Элементы.СуммаОсталосьПолучить.Гиперссылка = Гиперссылка;

	Элементы.СуммаКПоступлению.Заголовок = Формат(СуммаКПоступлению, ФорматСумм);
	
	Элементы.СуммаИсполнено.Заголовок = Формат(СуммаИсполнено, ФорматСумм);
	Гиперссылка = СуммаИсполнено <> 0;
	Элементы.СуммаИсполнено.Гиперссылка = Гиперссылка;

	Элементы.СуммаКОплате.Заголовок = Формат(СуммаКОплате, ФорматСумм);

	Элементы.СуммаПланируемыеПлатежи.Заголовок = Формат(ДанныеПлатежейСегодня.ПланируемыеПлатежиСегодняРасход, ФорматСумм);
	Гиперссылка = ДанныеПлатежейСегодня.ПланируемыеПлатежиСегодняРасход <> 0;
	Элементы.СуммаПланируемыеПлатежи.Гиперссылка = Гиперссылка;

	Элементы.СуммаВнеплановыеПлатежи.Заголовок = Формат(ДанныеПлатежейСегодня.ВнеплановыеПлатежиСегодняРасход, ФорматСумм);
	Гиперссылка = ДанныеПлатежейСегодня.ВнеплановыеПлатежиСегодняРасход <> 0;
	Элементы.СуммаВнеплановыеПлатежи.Гиперссылка = Гиперссылка;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеВнеплановыхПлатежей(ДанныеПлатежейСегодня, ОпцияПлатежи) Экспорт
	
	ОпцияПлатежи = ИспользоватьПланированиеПлатежей();
	
	ОтборБанковскийСчет = Новый Структура("БанковскийСчет", ДанныеПлатежейСегодня.БанковскийСчет);
    ОтборБанк = Новый Структура("Банк", ДанныеПлатежейСегодня.Банк);
	
	ДанныеПлатежейСегодня.МассивПлатежныхПоручений = Новый Массив;
	ДанныеПлатежейСегодня.ВнеплановыеПлатежиСегодняРасход = 0;
	
	Если ЭтоАдресВременногоХранилища(ДанныеПлатежейСегодня.АдресВнеплановыеПлатежиСегодня) Тогда
		ВнеплановыеПлатежи = ПолучитьИзВременногоХранилища(ДанныеПлатежейСегодня.АдресВнеплановыеПлатежиСегодня);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(ДанныеПлатежейСегодня.АдресПлатежныеПоручения) Тогда
		ТаблицаПлатежныхПоручений = ПолучитьИзВременногоХранилища(ДанныеПлатежейСегодня.АдресПлатежныеПоручения); 
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТаблицаПлатежныхПоручений = Неопределено Тогда
		Возврат;
	Конецесли;
	
	Если ЗначениеЗаполнено(ДанныеПлатежейСегодня.БанковскийСчет) Тогда
		ВнеплановыеПлатежи = ВнеплановыеПлатежи.Скопировать(ОтборБанковскийСчет);
		ДанныеПлатежейСегодня.МассивПлатежныхПоручений = 
			ТаблицаПлатежныхПоручений.Скопировать(ОтборБанковскийСчет).ВыгрузитьКолонку("ПлатежноеПоручение")
	ИначеЕсли ЗначениеЗаполнено(ДанныеПлатежейСегодня.Банк) Тогда
		ВнеплановыеПлатежи = ВнеплановыеПлатежи.Скопировать(ОтборБанк); 
		ДанныеПлатежейСегодня.МассивПлатежныхПоручений = 
			ТаблицаПлатежныхПоручений.Скопировать(ОтборБанк).ВыгрузитьКолонку("ПлатежноеПоручение");
	Иначе
		ДанныеПлатежейСегодня.МассивПлатежныхПоручений = 
			ТаблицаПлатежныхПоручений.ВыгрузитьКолонку("ПлатежноеПоручение");	
	КонецЕсли;
	
	ДанныеПлатежейСегодня.ВнеплановыеПлатежиСегодняРасход = ВнеплановыеПлатежи.Итог("Сумма");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет наличие данных о закрытии пользователем панели Платежи.
// см. ФинУслуги.ПоказыватьИнфоПанель.
//
// Возвращаемое значение:
//  Булево - Ложь - если медленный режим работы, Истина - если с момента закрытия прошло 30 дней
//  или пользователь не закрывал панель.
//
Функция НастройкаПоказыватьИнфоПанель()
	
	ЭтоМедленныйРежимРаботы = ОбщегоНазначенияБП.ЭтоМедленныйРежимРаботы();
	
	Если ЭтоМедленныйРежимРаботы Тогда
		Возврат Ложь;
	КонецЕсли;

	ИмяПользователя = ИмяПользователя();
	Возврат ПоказыватьИнфоПанель(ИмяПользователя);
	
КонецФункции

Функция ПланируемыеПлатежиПятьДней(ПлатежиПоДатам, ДатаПлатежаСегодня) 
		
	ПодходящиеСтроки = Новый Массив;
		
	Для Каждого СтрокаПлатежей Из ПлатежиПоДатам Цикл 
		Если СтрокаПлатежей.ДатаПлатежа <> ДатаПлатежаСегодня Тогда
			ПодходящиеСтроки.Добавить(СтрокаПлатежей);
			Если ПодходящиеСтроки.Количество() = 5 Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат ПлатежиПоДатам.Скопировать(ПодходящиеСтроки);
		
КонецФункции

Функция ПлатежиПоДатам(АдресХранилища)
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если ТипЗнч(РезультатВыполнения) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПлатежиПоДатам = РезультатВыполнения.Платежи;
	ПлатежиПоДатам.Свернуть("НомерРаздела, Документ, ДатаПлатежа", "Сумма"); 
	ТипизироватьТаблицуПлатежей(ПлатежиПоДатам);
	
	НоваяТаблица = ПлатежиПоДатам.СкопироватьКолонки();
	НоваяТаблица.Колонки.Добавить("Приход", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	НоваяТаблица.Колонки.Добавить("Расход", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
    НомераРазделовПоступлений = Обработки.ПлатежныйКалендарь.НомераРазделовДляГруппировкиПлатежей(Истина, Истина);
	НомераРазделовСписаний = Обработки.ПлатежныйКалендарь.НомераРазделовДляГруппировкиПлатежей(Истина);

	Для Каждого Строка Из ПлатежиПоДатам Цикл
		
		Если Строка.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы = НоваяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Строка); 
		Если НомераРазделовПоступлений.Найти(СтрокаТаблицы.НомерРаздела) <> Неопределено Тогда
			СтрокаТаблицы.Приход = СтрокаТаблицы.Сумма;
		КонецЕсли; 
		Если НомераРазделовСписаний.Найти(СтрокаТаблицы.НомерРаздела) <> Неопределено Тогда
			Если СтрокаТаблицы.Сумма < 0 Тогда
				СтрокаТаблицы.Расход = -СтрокаТаблицы.Сумма; 
			Иначе
				СтрокаТаблицы.Расход = СтрокаТаблицы.Сумма; 
			КонецЕсли;
		КонецЕсли;
					
	КонецЦикла;
	
	Возврат НоваяТаблица;
	
КонецФункции

Функция ПлатежиКалендаряСегодня(ПлатежиПоДатам, ДатаПлатежа)
	
	ПлатежиПоДатам.Индексы.Добавить("ДатаПлатежа");
	
	Отбор = Новый Структура("ДатаПлатежа", ДатаПлатежа); 
	ПлатежиКалендаряСегодня = ПлатежиПоДатам.Скопировать(Отбор);
	
	Возврат ПлатежиКалендаряСегодня;
	
КонецФункции

Функция ЗапросТаблицыВнеплановыхПлатежей()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПлатежиКалендаряСегодня.ДатаПлатежа КАК ДатаПлатежа,
		|	ПлатежиКалендаряСегодня.Сумма КАК Сумма,
		|	ПлатежиКалендаряСегодня.Документ КАК Документ,
		|	ПлатежиКалендаряСегодня.НомерРаздела КАК НомерРаздела
		|ПОМЕСТИТЬ ВТ_ПлатежиКалендаряСегодня
		|ИЗ
		|	&ПлатежиКалендаряСегодня КАК ПлатежиКалендаряСегодня
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежноеПоручение.ДокументОснование КАК ДокументОснование,
		|	ПлатежноеПоручение.Ссылка КАК ПлатежноеПоручение,
		|	ПлатежноеПоручение.СуммаДокумента КАК Сумма,
		|	ПлатежноеПоручение.СчетОрганизации КАК БанковскийСчет,
		|	Банки.Ссылка КАК Банк
		|ПОМЕСТИТЬ ПодготовленныеПлатежи
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|		ПО ПлатежноеПоручение.СчетОрганизации.Банк = Банки.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияБанковскихДокументов КАК СостоянияБанковскихДокументов
		|		ПО (СостоянияБанковскихДокументов.СсылкаНаОбъект = ПлатежноеПоручение.Ссылка)
		|			И (СостоянияБанковскихДокументов.Организация = ПлатежноеПоручение.Организация)
		|			И (СостоянияБанковскихДокументов.Состояние В (&Состояние))
		|ГДЕ
		|	ПлатежноеПоручение.Дата МЕЖДУ &ДатаПлатежаНачало И &ДатаПлатежаКонец
		|	И ПлатежноеПоручение.ПометкаУдаления = ЛОЖЬ
		|	И &ОтборПоОрганизации
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодготовленныеПлатежи.ПлатежноеПоручение КАК ПлатежноеПоручение,
		|	ПодготовленныеПлатежи.БанковскийСчет КАК БанковскийСчет,
		|	ПодготовленныеПлатежи.Банк КАК Банк,
		|	СУММА(ПодготовленныеПлатежи.Сумма) КАК Сумма
		|ИЗ
		|	ПодготовленныеПлатежи КАК ПодготовленныеПлатежи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлатежиКалендаряСегодня КАК ВТ_ПлатежиКалендаряСегодня
		|		ПО (ВТ_ПлатежиКалендаряСегодня.Документ = ПодготовленныеПлатежи.ДокументОснование)
		|ГДЕ
		|	ВТ_ПлатежиКалендаряСегодня.Документ ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ПодготовленныеПлатежи.ПлатежноеПоручение,
		|	ПодготовленныеПлатежи.БанковскийСчет,
		|	ПодготовленныеПлатежи.Банк";
	
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПараметрыЗакрытияИнфоПанель()
	
	Результат = Новый Структура();
	Результат.Вставить("ДатаЗакрытия", Дата(1, 1, 1));
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьТаблицуДатами(ПланируемыеПлатежи, ДатаАктуальности)
	
	ДлинаСуток = 86400;
	КоличествоЗаполненныхДней = ПланируемыеПлатежи.Количество();
	Если КоличествоЗаполненныхДней = 0 Тогда
		ПоследнийЗаполненныйДень = ДатаАктуальности;
	Иначе
		ПоследнийЗаполненныйДень = ПланируемыеПлатежи[КоличествоЗаполненныхДней - 1].ДатаПлатежа;
	КонецЕсли;
	
	МаксимальноеКоличествоДней = 5; 
	ДобавитьДней = МаксимальноеКоличествоДней - КоличествоЗаполненныхДней;
		
	Для НомерДня = 1 По ДобавитьДней Цикл
		
		СтрокаПлатежиПоДням = ПланируемыеПлатежи.Добавить();
		ДатаПлатежа = ПоследнийЗаполненныйДень + ДлинаСуток * НомерДня;
		СтрокаПлатежиПоДням.ДатаПлатежа = ДатаПлатежа;

	КонецЦикла;

КонецПроцедуры

Процедура ТипизироватьТаблицуПлатежей(ПлатежиПоДатам)
	
	ПлатежиПоДатам.Колонки.Добавить("ТипизированныйДокумент", Документы.ТипВсеСсылки());
	МассивДокументов = ПлатежиПоДатам.ВыгрузитьКолонку("Документ");
	ПлатежиПоДатам.ЗагрузитьКолонку(МассивДокументов, "ТипизированныйДокумент");
	ПлатежиПоДатам.Колонки.Удалить("Документ");
	ПлатежиПоДатам.Колонки.ТипизированныйДокумент.Имя = "Документ"; // Переименовываем колонку
	
КонецПроцедуры

Функция МассивСтатистики(ТаблицаСтатистики)
	
	Статистика = ТаблицаСтатистики.Выгрузить();
	Если ТаблицаСтатистики.Итог("Показы") = 0 Тогда
		Статистика.Свернуть("Банк, ИДУслуги, ИДРекламы, ИмяФормы", "Переходы");
	ИначеЕсли ТаблицаСтатистики.Итог("Переходы") = 0 Тогда
		Статистика.Свернуть("Банк, ИДУслуги, ИДРекламы, ИмяФормы", "Показы"); 
	Иначе
		Статистика.Свернуть("Банк, ИДУслуги, ИДРекламы, ИмяФормы", "Показы, Переходы"); 
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Статистика);
	
КонецФункции

Процедура ОбработатьХарактеристику(Характеристика, УслугаБанка)
	
	Если Характеристика.Характеристика <> Перечисления.ХарактеристикиСервисаФинУслуги.ГруппыКонтрагентов
		И Характеристика.Характеристика <> Перечисления.ХарактеристикиСервисаФинУслуги.ГруппыКомпанийБанков Тогда
		Возврат;
	КонецЕсли;
				
	ЗначениеХарактеристики = Характеристика.Значение.Получить();
	Если Не ЗначениеЗаполнено(ЗначениеХарактеристики) Тогда
		Возврат;
	КонецЕсли;
	
	СервисХарактеристики = Перечисления.СервисыОбменаСБанками.ФинУслуги;
	
	ОбъектXDTOХарактеристики = ОбъектXDTOХарактеристики(СервисХарактеристики, ЗначениеХарактеристики);
	
	Банк = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УслугаБанка, "Банк");
	
	Если Характеристика.Характеристика = Перечисления.ХарактеристикиСервисаФинУслуги.ГруппыКонтрагентов Тогда
		РегистрыСведений.ГруппыКонтрагентовЗаявкиВБанки.ЗаписатьГруппыКонтрагентов(СервисХарактеристики, 
			ОбъектXDTOХарактеристики, Банк); 
	Иначе
		РегистрыСведений.ГруппыКомпанийБанков.ЗаписатьГруппыКомпанийБанков(СервисХарактеристики, 
			ОбъектXDTOХарактеристики, Банк);
	КонецЕсли;
	
КонецПроцедуры

Функция ГражданствоФизическогоЛица(ФизическоеЛицо) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ГражданствоФизическихЛицСрезПоследних.Страна КАК Страна
		|ИЗ
		|	РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(, ФизическоеЛицо = &ФизическоеЛицо) КАК ГражданствоФизическихЛицСрезПоследних";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Страна;
	КонецЕсли;
	
	Возврат Справочники.СтраныМира.ПустаяСсылка();
	
КонецФункции

Функция НовыйКреативыБанков()
	
	ТаблицаКреативов = Новый ТаблицаЗначений;
	ТаблицаКреативов.Колонки.Добавить("Банк", Новый ОписаниеТипов("СправочникСсылка.БанкиУниверсальногоОбмена"));
	ТаблицаКреативов.Колонки.Добавить("ИмяКреатива", ОбщегоНазначения.ОписаниеТипаСтрока(0)); 
	ТаблицаКреативов.Колонки.Добавить("АдресКреатива", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	Возврат ТаблицаКреативов;
	
КонецФункции

Функция ПодготовитьПараметрыЗаполненияКалендаря(Организация, ГоризонтПланирования)
	
	ПараметрыЗадания = Обработки.ПлатежныйКалендарь.НовыеПараметрыЗаполнения();
	ПараметрыЗадания.Организация = Организация;
	ПараметрыЗадания.ДнейПланирования = ГоризонтПланирования;  
	ПараметрыЗадания.ОтключитьВыводВТабличныйДокумент = Истина;
	ПараметрыЗадания.ПолучатьОстаток = Ложь;
	
	Возврат ПараметрыЗадания;
	
КонецФункции

Функция ПараметрыПолученияПредложенийПоВидуФормы(Форма)
	
	Результат = Новый Структура;
	Результат.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	Результат.Вставить("Банк", Справочники.Банки.ПустаяСсылка());
    Результат.Вставить("ДатаПолучения", Дата(1, 1, 1));
    Результат.Вставить("ИмяФормы", Форма.ИмяФормы);
    Результат.Вставить("КоличествоБаннеров", 0);

	Если ФинУслугиКлиентСервер.ЭтоФормаФинансыОрганизации(Форма.ИмяФормы) Тогда
		Результат.Организация = Форма.Организация;
		Результат.Банк = Форма.Банк;
		Результат.ДатаПолучения = Форма.ДатаАктуальности;
		// В Финансы организации нет реквизита "КоличествоБаннеров".
	ИначеЕсли ФинУслугиКлиентСервер.ЭтоФормаБанковскогоСчета(Форма.ИмяФормы) Тогда 
		Результат.Организация = Форма.Объект.Владелец;
		Результат.Банк = Форма.Объект.Банк;
		Результат.ДатаПолучения = ТекущаяДата();
		Результат.КоличествоБаннеров = Форма.КоличествоБаннеров;
	Иначе
		// В ИнфоПанели необходимые параметы хранятся
		// в ДанныеПлатежейСегодня
		Результат.Организация = Форма.ДанныеПлатежейСегодня.Организация;
		Результат.Банк = Форма.ДанныеПлатежейСегодня.Банк;
		Результат.ДатаПолучения = Форма.ДанныеПлатежейСегодня.ДатаАктуальности;
		Результат.КоличествоБаннеров = Форма.КоличествоБаннеров;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВысотаЭкрана()
	
	ИнформацияЭкрана = ОбщегоНазначенияКлиентСервер.ПараметрыЭкранаУстройства();
	Возврат ИнформацияЭкрана.Высота;
	
КонецФункции

Функция АдресаКреативовБанковДляОчистки(КреативыБанков)
	
	МассивАдресов = Новый Массив;
	
	Для Каждого Креатив Из КреативыБанков Цикл 
		МассивАдресов.Добавить(Креатив.АдресКреатива);
	КонецЦикла;
	КреативыБанков.Очистить();

	Возврат МассивАдресов;
		
КонецФункции

Процедура ОчиститьАдресВоВременномХранилище(МассивАдресов)
	
	Для Каждого АдресКреатива Из МассивАдресов Цикл 
		Если ЭтоАдресВременногоХранилища(АдресКреатива) Тогда
			УдалитьИзВременногоХранилища(АдресКреатива);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Функция ХешСуммаСтроки(ИсходнаяСтрока)
	
	ХешированиеДанныхОбъект = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешированиеДанныхОбъект.Добавить(ИсходнаяСтрока);
	
	Возврат Base64Строка(ХешированиеДанныхОбъект.ХешСумма);
	
КонецФункции

#КонецОбласти

#Область ОбновлениеЭлементовФорм

Процедура ОбновитьОтображениеФинУслуги(Форма, АдресРезультата) Экспорт
	
	ОбновитьДоступныеПредложения(Форма, АдресРезультата);
	ОбновитьБаннеры(Форма);
	Если ФинУслугиКлиентСервер.ЭтоФормаБанковскогоСчета(Форма.ИмяФормы) Тогда 
		ОбновитьГруппуСервисыБанка(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДоступныеПредложения(Форма, АдресРезультата)
	
	Форма.ТаблицаПредложенийБанков.Очистить();
	Форма.ТекущаяПозицияБаннеры = 1;
	Если Форма.ТаблицаПредложенийБанков.Количество() = 0 Тогда
		
		СведенияОПредложениях = ДанныеПредложенийИКреативов(АдресРезультата, Форма.УникальныйИдентификатор);
		Форма.ТаблицаПредложенийБанков.Загрузить(СведенияОПредложениях.Предложения);
		Форма.КреативыБанков.Загрузить(СведенияОПредложениях.Креативы);

	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеПредложенийИКреативов(АдресРезультата, УникальныйИдентификатор) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Предложения");
	Результат.Вставить("Креативы");
	
	СведенияПоПредложениям = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Креативы = ФинУслуги.ДанныеКреативов(
		СведенияПоПредложениям.Банки, СведенияПоПредложениям.МассивИменФайлов, УникальныйИдентификатор);

	Результат.Предложения = СведенияПоПредложениям.Предложения;
    Результат.Креативы = Креативы;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьБаннеры(Форма, НаправлениеВперед = Неопределено) Экспорт
	
	Если ФинУслугиКлиентСервер.ЭтоФормаФинансыОрганизации(Форма.ИмяФормы) Тогда
		Форма.ОбновитьБаннеры();
		Возврат;
	КонецЕсли;

	ОчиститьБаннеры(Форма);
	ТекущаяПозицияБаннеры = Форма.ТекущаяПозицияБаннеры;
	КоличествоПредложений = Форма.ТаблицаПредложенийБанков.Количество();
	ЕстьПредложенияБанков = КоличествоПредложений <> 0;
	ФинУслугиКлиентСервер.УстановитьВидимостьФинУслуги(Форма, ЕстьПредложенияБанков);
	
	Если Не ЕстьПредложенияБанков Тогда
		Возврат;
	КонецЕсли;
	
	СмещениеПозиции = Форма.КоличествоБаннеров - 1;
	ПоследняяПозиция = ТекущаяПозицияБаннеры + СмещениеПозиции;
	ПоследняяПозицияВИтерации = Мин(ПоследняяПозиция, КоличествоПредложений);
	
	Для Итератор = ТекущаяПозицияБаннеры По ПоследняяПозицияВИтерации Цикл
		
		НомерСтроки = ФинУслугиКлиентСервер.НомерСтрокиПоПозиции(Итератор, ТекущаяПозицияБаннеры);
		ПредложениеБанка = Форма.ТаблицаПредложенийБанков.Получить(Итератор - 1);
		УстановитьПараметрыБаннера(Форма, ПредложениеБанка, НомерСтроки);
		Если НаправлениеВперед = Неопределено 
			Или (НаправлениеВперед = Истина И Итератор = ПоследняяПозицияВИтерации)
			Или (НаправлениеВперед = Ложь И Итератор = ТекущаяПозицияБаннеры) Тогда
			
         	ФинУслугиКлиентСервер.ДополнитьТаблицуСтатистики(Форма.ТаблицаСтатистики, ПредложениеБанка, 1, 0, Форма.ИмяФормы); 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ФинУслугиКлиентСервер.ЭтоФормаБанковскогоСчета(Форма.ИмяФормы) Тогда

		УстановитьВидимостьПереключателяБаннеров(Форма, ТекущаяПозицияБаннеры, ПоследняяПозиция, КоличествоПредложений);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьБаннеры(Форма, РазрешениеЭкрана = "") Экспорт
	
	Если РазрешениеЭкрана = "" Тогда
		МаксимальноеКоличествоБаннеров = Форма.КоличествоБаннеров;	
	Иначе
		// В форме Финансы организации нет реквизита "КоличествоБаннеров"
		МаксимальноеКоличествоБаннеров = ФинУслугиКлиентСервер.МаксимальноеКоличествоБаннеров(Форма.ИмяФормы);
	КонецЕсли;
	Для НомерБаннера = 1 По МаксимальноеКоличествоБаннеров Цикл
		
		УстановитьПараметрыБаннера(Форма, Неопределено, НомерБаннера, РазрешениеЭкрана) 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПараметрыБаннера(Форма, ПредложениеБанка, НомерБаннера, РазрешениеЭкрана = "") Экспорт
	
	ИнфоПанель =  ФинУслугиКлиентСервер.ЭтоФормаСИнформационнойПанелью(Форма.ИмяФормы);
	
	Если ПредложениеБанка = Неопределено Тогда
		ДанныеКреатива = "";
		ИдентификаторУслуги = "";
		ВидимостьПодменю = Ложь; 
		ЦветБаннера = Новый Цвет();
	Иначе
		ИмяФайлаКреатива = ?(ИнфоПанель, ПредложениеБанка.ИмяФайлаКреативаИнфоПанель, ПредложениеБанка.ИмяФайлаКреатива);	
		ДанныеКреатива = ДанныеКреатива(Форма, ИмяФайлаКреатива, ПредложениеБанка.Банк);
		ИдентификаторУслуги = ПредложениеБанка.ИдентификаторУслуги;
		ВидимостьПодменю = Истина;
		ЦветБаннера = ЦветБаннера();
	КонецЕсли;
	ИмяРеквизита = СтрШаблон("Баннер%1", НомерБаннера);
	Форма[ИмяРеквизита] = ДанныеКреатива;
	ИмяРеквизита = СтрШаблон("Баннер%1Идентификатор", НомерБаннера);
	Форма[ИмяРеквизита] = ИдентификаторУслуги; 
	Наименование = СтрШаблон("ГруппаГоризонтальнаяБаннер%1%2", НомерБаннера, РазрешениеЭкрана);
	Форма.Элементы[Наименование].ЦветФона = ЦветБаннера;
	Форма.Элементы[Наименование].Видимость = Истина;
	Наименование = СтрШаблон("Баннер%1%2", НомерБаннера, РазрешениеЭкрана);
	Форма.Элементы[Наименование].Доступность = ВидимостьПодменю;
	
	Наименование = СтрШаблон("ПодменюБаннер%1", НомерБаннера);
	ФинУслугиКлиентСервер.УстановитьВидимостьЭлемента(Форма.Элементы, Наименование, ВидимостьПодменю, РазрешениеЭкрана);
	
КонецПроцедуры

Функция ДанныеКреатива(Форма, ИмяФайлаКреатива, Банк)
	
	Отбор = Новый Структура("Банк, ИмяКреатива", Банк, ИмяФайлаКреатива); 
	МассивСтрок = Форма.КреативыБанков.НайтиСтроки(Отбор);
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат МассивСтрок[0].АдресКреатива;
	
КонецФункции

Процедура ОбновитьГруппуСервисыБанка(Форма)
	
	Элементы = Форма.Элементы;
	ТаблицаПредложенийБанков = Форма.ТаблицаПредложенийБанков; 
	Для Каждого СтрокаУслуг Из ТаблицаПредложенийБанков Цикл
		
		Если ЗначениеЗаполнено(СтрокаУслуг.КраткоеОписание) Тогда
			ЗаполнитьКраткоеОписание(Элементы, СтрокаУслуг);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаУслуг.ПодробноеОписание) Тогда
			ЗаполнитьПодробноеОписание(Элементы, СтрокаУслуг, Форма.ЦветГиперссылки);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКраткоеОписание(Элементы, СтрокаУслуг)
	
	Если СтрокаУслуг.УслугаСБП Тогда
		Элементы.КраткоеОписаниеСБП.Заголовок = СтрокаУслуг.КраткоеОписание;
	ИначеЕсли СтрокаУслуг.УслугаЭквайринг Тогда
		Элементы.КраткоеОписаниеЭквайринг.Заголовок = СтрокаУслуг.КраткоеОписание;
	ИначеЕсли СтрокаУслуг.УслугаБизнесКарты Тогда
		Элементы.КраткоеОписаниеБизнесКарты.Заголовок = СтрокаУслуг.КраткоеОписание;
	ИначеЕсли СтрокаУслуг.УслугаЗарплатныйПроект Тогда
		Элементы.КраткоеОписаниеЗарплатныйПроект.Заголовок = СтрокаУслуг.КраткоеОписание;
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьПодробноеОписание(Элементы, СтрокаУслуг, ЦветГиперссылки)
	
	Если СтрокаУслуг.УслугаСБП Тогда	
		Элементы.ОписаниеСБП.Заголовок = ОписаниеУслуги(
			СтрокаУслуг.ПодробноеОписание, ЦветГиперссылки, "УслугаСБП");	
	ИначеЕсли СтрокаУслуг.УслугаЭквайринг Тогда
		Элементы.ОписаниеЭквайринг.Заголовок = ОписаниеУслуги(
			СтрокаУслуг.ПодробноеОписание, ЦветГиперссылки, "УслугаЭквайринг");
	ИначеЕсли СтрокаУслуг.УслугаБизнесКарты Тогда
		Элементы.ОписаниеБизнесКарты.Заголовок = ОписаниеУслуги(
			СтрокаУслуг.ПодробноеОписание, ЦветГиперссылки, "УслугаБизнесКарты");
	ИначеЕсли СтрокаУслуг.УслугаЗарплатныйПроект Тогда
		Элементы.ОписаниеЗарплатныйПроект.Заголовок = ОписаниеУслуги(
			СтрокаУслуг.ПодробноеОписание, ЦветГиперссылки, "УслугаЗарплатныйПроект");
	КонецЕсли;
		
КонецПроцедуры

Функция ОписаниеУслуги(Описание, ЦветГиперссылки, НаименованиеУслуги)
	
	СоставСтрокиОписание = Новый Массив;	
	ТекстГиперссылки = НСтр("ru = 'Подробнее'");

	ТекстОписание = Новый ФорматированнаяСтрока(Описание + " ");
	СоставСтрокиОписание.Добавить(ТекстОписание);
	Подробнее = Новый ФорматированнаяСтрока(
		ТекстГиперссылки,, ЦветГиперссылки,, НаименованиеУслуги);
	СоставСтрокиОписание.Добавить(Подробнее);
    ОписаниеСГиперссылкой = Новый ФорматированнаяСтрока(СоставСтрокиОписание);
	
	Возврат ОписаниеСГиперссылкой;
	
КонецФункции

Процедура УстановитьВидимостьПереключателяБаннеров(
		Форма, ТекущаяПозиция, ПоследняяПозиция, КоличествоСтрокТаблицы, РазрешениеЭкрана = "") Экспорт
		
	Элементы = Форма.Элементы;
	ЕстьСледующиеСтраницы = ПоследняяПозиция < КоличествоСтрокТаблицы;
	ФинУслугиКлиентСервер.УстановитьВидимостьЭлемента(Элементы, "ПереключитьСтраницуБаннеров", ЕстьСледующиеСтраницы, РазрешениеЭкрана);
	ФинУслугиКлиентСервер.УстановитьВидимостьЭлемента(Элементы, "ПереключитьНедоступный", Не ЕстьСледующиеСтраницы, РазрешениеЭкрана);

	ЕстьПредыдущиеСтраницы = ТекущаяПозиция > 1;
	ФинУслугиКлиентСервер.УстановитьВидимостьЭлемента(Элементы, "ПереключитьОбратноСтраницуБаннеров", ЕстьПредыдущиеСтраницы, РазрешениеЭкрана);
	ФинУслугиКлиентСервер.УстановитьВидимостьЭлемента(Элементы, "ПереключитьОбратноНедоступный", Не ЕстьПредыдущиеСтраницы, РазрешениеЭкрана);
	
	ОтображатьГруппу = ЕстьСледующиеСтраницы Или ЕстьПредыдущиеСтраницы; 
	ФинУслугиКлиентСервер.УстановитьВидимостьЭлемента(Элементы, "ГруппаПереключитьСтраницуБаннеров", ОтображатьГруппу, РазрешениеЭкрана);

КонецПроцедуры

Функция ЦветБаннера() 
	
	Возврат Новый Цвет(248, 248, 248);
	
КонецФункции

#КонецОбласти
